/******************************************************************************

                  版权所有 (C), 2001-2011, 上海寰创通信股份有限公司

 ******************************************************************************
  文 件 名   : nf_portal_ioctl_main.c
  版 本 号   : 初稿
  作    者   : Zhong Huaqing
  生成日期   : 2012年8月15日 星期三
  最近修改   :
  功能描述   : nf_portal模块工具
  函数列表   :
  修改历史   :
  1.日    期   : 2012年8月15日 星期三
    作    者   : Zhong Huaqing
    修改内容   : 创建文件

******************************************************************************/

/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/
#include <stdio.h>
#include <unistd.h>
#include <sys/types.h>  
#include <string.h>

#include "nf_portal_ioctl_main.h"
#include "nf_portal_ioctl_cmd.h"

/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/
//int g_stSocketFd;

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/
/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 函数定义                                       *
 *----------------------------------------------*/

INT32 main(INT32 iArgc, CHAR *apcArgv[])
{
    NF_PORTAL_CMD_T *pstCmd;
    CHAR *szCmdName = NULL;
    AP_ERROR_CODE_E enRet;
    
    if (iArgc < 2)
    {
        printf("Parameters invalid!\n");
        nf_portal_show_help(NULL);
        return -1;
    }
    
    /*查找命令对应结构*/
    szCmdName = apcArgv[1];
    pstCmd = nf_portal_get_cmd(szCmdName);
    if (NULL == pstCmd)
    {
        printf("Command invalid!\n");
        //nf_portal_show_help(NULL);
        return -1;
    }
    
    /*执行命令*/
    iArgc--;
	apcArgv++;
	enRet = pstCmd->fHandler(iArgc, apcArgv);
	if (AP_E_NONE != enRet)
	{
	    printf("Command %s executed failed. ret %d\n", szCmdName, enRet);
	}
    
    return 0;
}

