/******************************************************************************

                  版权所有 (C), 2010-2012, 上海寰创通信科技有限公司

 ******************************************************************************
  文 件 名   : commonString.c
  版 本 号   : 初稿
  作    者   : zhangjiasi
  生成日期   : 2015年6月11日
  最近修改   :
  功能描述   : 树节点数组定义并初始化
  函数列表   :
  修改历史   :
  1.日    期   : 2015年6月11日
    作    者   : zhangjiasi
    修改内容   : 创建文件

******************************************************************************/
#define  CPEVARNAMEINSTANCE
#include "commonString.h"


