/******************************************************************************

                  版权所有 (C), 2001-2011, 上海寰创通信股份有限公司

 ******************************************************************************
  文 件 名   : gpioex_ioctl_ops.h
  版 本 号   : 初稿
  作    者   : Zhong Huaqing
  生成日期   : 2012年8月10日 星期五
  最近修改   :
  功能描述   : gpioex_ioctl_ops.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2012年8月10日 星期五
    作    者   : Zhong Huaqing
    修改内容   : 创建文件

******************************************************************************/

#ifndef __GPIOEX_IOCTL_OPS_H__
#define __GPIOEX_IOCTL_OPS_H__


/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 基础类型定义                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/

#define GPIOEX_FILE_NAME_SIZE  256
#define FD_INVALID          (-1)  /*无效文件ID号*/

#define GPIOEX_DEBUG_LEVEL_MAX    7

 /*----------------------------------------------*
 * 宏操作                                       *
 *----------------------------------------------*/


/*----------------------------------------------*
 * 枚举定义                                       *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 扩展类型定义                                     *
 *----------------------------------------------*/


/*----------------------------------------------*
 * 结构定义                                       *
 *----------------------------------------------*/




/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 导出函数原型说明                             *
 *----------------------------------------------*/
AP_ERROR_CODE_E gpioex_cmd_get_mod_version(GPIOEX_IOCTL_VERSION_T *pstVersion);

AP_ERROR_CODE_E gpioex_cmd_set_debug_level(UINT32 uiDebugLevel);
AP_ERROR_CODE_E gpioex_cmd_get_debug_level(UINT32 *puiDebugLevel);

AP_ERROR_CODE_E gpioex_cmd_set_all_mode(GPIOEX_IOCTL_MODE_ALL_T stAllMode);
AP_ERROR_CODE_E gpioex_cmd_get_all_mode(GPIOEX_IOCTL_MODE_ALL_T *pstAllMode);

AP_ERROR_CODE_E gpioex_cmd_set_mode(GPIOEX_IOCTL_MODE_T stMode);
AP_ERROR_CODE_E gpioex_cmd_get_mode(GPIOEX_IOCTL_MODE_T *pstMode);

AP_ERROR_CODE_E gpioex_cmd_set_all_state(GPIOEX_IOCTL_STATE_ALL_T stAllState);
AP_ERROR_CODE_E gpioex_cmd_get_all_state(GPIOEX_IOCTL_STATE_ALL_T *pstAllState);

AP_ERROR_CODE_E gpioex_cmd_set_state(GPIOEX_IOCTL_STATE_T stState);
AP_ERROR_CODE_E gpioex_cmd_get_state(GPIOEX_IOCTL_STATE_T *pstState);


#endif /* __GPIOEX_IOCTL_OPS_H__ */


