/******************************************************************************

                  版权所有 (C), 2001-2011, 上海寰创通信股份有限公司

 ******************************************************************************
  文 件 名   : fc_main.c
  版 本 号   : 初稿
  作    者   : Zhong Huaqing
  生成日期   : 2012年8月10日 星期五
  最近修改   :
  功能描述   : AP流控模块
  函数列表   :
  修改历史   :
  1.日    期   : 2012年8月10日 星期五
    作    者   : Zhong Huaqing
    修改内容   : 创建文件

******************************************************************************/

/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/

#include "gpioex_main.h"


/*----------------------------------------------*
 * 宏定义                                *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/
    
void ar9344_gpio_config_input(int gpio)
{
    ar9344_reg_rmw_set(AR9344_GPIO_OE, (1 << gpio));
}

void ar9344_gpio_config_output(int gpio)
{
    ar9344_reg_rmw_clear(AR9344_GPIO_OE, (1 << gpio));
}
int ar9344_gpio_in_val(int gpio)
{
    return((1 << gpio) & (ar9344_reg_rd(AR9344_GPIO_IN)));
}
void  ar9344_gpio_drive_low(unsigned int mask)
{
  ar9344_reg_wr(AR9344_GPIO_CLEAR, mask);
  //ar9344_reg_rmw_clear(AR9344_GPIO_OE, mask);
}

void ar9344_gpio_drive_high(unsigned int mask)
{
  ar9344_reg_wr(AR9344_GPIO_SET, mask);
  //ar9344_reg_rmw_clear(AR9344_GPIO_OE, mask);
}


/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/
GPIOEX_LOG_LEVEL_E g_enDebugLevel = GPIOEX_LOG_DEBUG;
UINT8 g_ucHardVer = 0;

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/
 

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 函数定义                                       *
 *----------------------------------------------*/

AP_ERROR_CODE_E gpioex_set_debugLevel(UINT32 uiDebugLevel)
{
    if (uiDebugLevel > GPIOEX_LOG_DEBUG)
    {
        return AP_E_PARAM;
    }
    g_enDebugLevel = uiDebugLevel;
    return AP_E_NONE;
}

UINT32 gpioex_get_debugLevel(void)
{
    return g_enDebugLevel;
}



/*****************************************************************************
 函 数 名  : gpioex_init
 功能描述  : gpioex模块初始化入口
 输入参数  : void  
 输出参数  : 无
 返 回 值  : 
 调用函数  : 
 被调函数  : 
 
 修改历史      :
  1.日    期   : 2012年9月27日 星期四
    作    者   : Zhong Huaqing
    修改内容   : 新生成函数

*****************************************************************************/
AP_ERROR_CODE_E gpioex_init(void)
{
    UINT32 uiRd = 0;



    /*DISABLE JTAG*/
    ar9344_reg_rmw_set(AR9344_GPIO_FUNCTIONS,0x00000002);

#if 1
    /*片选GPIO EXP :GPIO 2*/
    ar9344_gpio_config_output(2);

    uiRd = ar9344_reg_rd(AR9344_GPIO_OUT_FUNCTION0);
    uiRd = (uiRd &(~(0x00ff0000)))|0x000A0000;
    ar9344_reg_wr_nf(AR9344_GPIO_OUT_FUNCTION0,uiRd);
#endif    
    /* 先配置状态，后配置模式，解决由于内部寄存器翻转导致优先配置mode会导致设
       备重启的bug */


    return AP_E_NONE;
}

/*****************************************************************************
 函 数 名  : gpioex_destroy
 功能描述  : gpioex模块销毁入口
 输入参数  : void  
 输出参数  : 无
 返 回 值  : 
 调用函数  : 
 被调函数  : 
 
 修改历史      :
  1.日    期   : 2012年9月27日 星期四
    作    者   : Zhong Huaqing
    修改内容   : 新生成函数

*****************************************************************************/
AP_ERROR_CODE_E gpioex_destroy(void)
{
    GPIOEX_LOG(GPIOEX_LOG_INFO, "Gpioex destroy.\n");
    return AP_E_NONE;
}


