/******************************************************************************

                  版权所有 (C), 2001-2011, 上海寰创通信股份有限公司

 ******************************************************************************
  文 件 名   : gpioex_module.c
  版 本 号   : 初稿
  作    者   : Zhong Huaqing
  生成日期   : 2012年8月13日 星期一
  最近修改   :
  功能描述   : 流控模块初始化
  函数列表   :

  修改历史   :
  1.日    期   : 2012年8月13日 星期一
    作    者   : Zhong Huaqing
    修改内容   : 创建文件

******************************************************************************/

/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/
#include <linux/kernel.h>
#include <linux/module.h>
#include <linux/types.h>

#include <linux/proc_fs.h>

#include "gpioex_main.h"

#include "procfs_fops.h"
#include "gpioex_ioctl.h"

/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/
REMOTE AP_ERROR_CODE_E gpioex_ioctl_handler(void *pstArg);

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 函数定义                                       *
 *----------------------------------------------*/


LOCAL int gpioex_init_module(void)
{
	gpioex_init();
	
	procfs_fops_hook_set(gpioex_ioctl_handler);
	procfs_fops_init(GPIOEX_PROC_FILE);
	
	return 0;
}

LOCAL void  gpioex_cleanup_module(void)
{

	procfs_fops_destroy(GPIOEX_PROC_FILE);
	procfs_fops_hook_set(NULL);
	
	gpioex_destroy();
	return;
}


module_init(gpioex_init_module);
module_exit(gpioex_cleanup_module);

MODULE_LICENSE("GPL");

/*End of File*/

