/******************************************************************************
模块名      : 
文件名      : 
相关文件    :
实现功能    : 
修改记录    :
------------------------------------------------------------------------------
日期        修改人      修改内容
2013-07-08  冯静        创建
******************************************************************************/

#ifndef _MD5LIB_H
#define _MD5LIB_H

/************************************ 常量定义 *******************************/

/************************************ 数据结构 *******************************/
struct MD5Context
{
	unsigned long buf[4];
	unsigned long bits[2];
	unsigned char in[64];
};

typedef struct MD5Context MD5_CTX;
/************************************ 函数声明 *******************************/
void md5_vector(size_t num_elem, unsigned char *addr[], size_t *len, unsigned char *mac);

// 输入任意一个字符串，经过md5算法处理后，返回结果：一个定长（32个字符）字符串
char* MDString  (char *);

// 输入任意一个文件名，文件内容经过md5算法处理后，返回结果：一个定长（32个字符）字符串
char* MDFile (char *);
char* hmac_md5(char* text, char* key);
// 输入任意一个字符串text,和一个用做密钥的字符串key,经过hmac_md5算法处理，返回处理结果：一个定长字符串（32个字符）

#endif

