/******************************************************************************

                  版权所有 (C), 2001-2011, 上海寰创通信股份有限公司

 ******************************************************************************
  文 件 名   : pal_types.h
  版 本 号   : 初稿
  作    者   : Zhong Huaqing
  生成日期   : 2012年7月23日 星期一
  最近修改   :
  功能描述   : pal_main.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2012年7月23日 星期一
    作    者   : Zhong Huaqing
    修改内容   : 创建文件

  2.日    期   : 2012年8月15日 星期三
    作    者   : xucongjiang
    修改内容   : 增加返回值值类型
******************************************************************************/

#ifndef __PAL_TYPES_H__
#define __PAL_TYPES_H__


/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/
#include "ap_types.h"
/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/
 /*PAL 模块支持的接口类型*/
#define PAL_INTF_IOCTL         (1<<0)
/* 2012-8-29 del by zhangping
#define PAL_INTF_IOCTL_ASYNC   (1<<1)
#define PAL_INTF_EVENT         (1<<2)
#define PAL_INTF_ALL           (PAL_INTF_IOCTL | PAL_INTF_IOCTL_ASYNC | PAL_INTF_EVENT)
*/
 /*----------------------------------------------*
 * 宏操作                                       *
 *----------------------------------------------*/

#define offsetof(TYPE, MEMBER) ((size_t) &((TYPE *)0)->MEMBER)

 /**
 * container_of - cast a member of a structure out to the containing structure
 * @ptr:	the pointer to the member.
 * @type:	the type of the container struct this is embedded in.
 * @member:	the name of the member within the struct.
 *
 */
#define container_of(ptr, type, member) ({			\
	const typeof( ((type *)0)->member ) *__mptr = (ptr);	\
	(type *)( (char *)__mptr - offsetof(type,member) );})

 
/*----------------------------------------------*
 * 枚举定义                                       *
 *----------------------------------------------*/

typedef enum 
{
    AP_EVENT_NOT_HANDLED = 0,       /*event is not handled*/
    AP_EVENT_HANDLED,               /*event is handled*/
}PAL_EVENT_HANDLE_STATUS_E;


/*----------------------------------------------*
 * 扩展类型定义                                     *
 *----------------------------------------------*/
typedef AP_ERROR_CODE_E (*PAL_IOCTL_HANDLER_F)(void *pvData, INT32 iDataLen);
typedef PAL_EVENT_HANDLE_STATUS_E (*PAL_EVENT_HANDLER_F)(void *pvData, INT32 iDataLen);


/*----------------------------------------------*
 * 结构定义                                       *
 *----------------------------------------------*/



#endif /* __PAL_TYPES_H__ */
