/******************************************************************************

                  版权所有 (C), 2007-2012, 上海寰创通信科技有限公司

 ******************************************************************************
  文 件 名   : pal_portmap.h
  版 本 号   : 初稿
  作    者   : 董鹏
  生成日期   : 2014年4月18日
  最近修改   :
  功能描述   : portmap pal API
  函数列表   :
  修改历史   :
  1.日    期   :
    作    者   : 
    修改内容   : 

******************************************************************************/
#ifndef __PAL_PORTMAP_H__
#define __PAL_PORTMAP_H__


/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/
#define IPADDRLEN           16

typedef struct
{   
    unsigned short usOutport;      /* Out net port*/    
    unsigned short usInport;       /* In net port*/  
	unsigned char acIp[IPADDRLEN];     /* ip */     
    unsigned char ucProt;     /* protocal */ 
}PORTMAP_INFO_E;            

typedef struct
{
    unsigned int uiIterm;                 /* Iterm count */
    PORTMAP_INFO_E *pstPortmapInfo;
    
}PORTMAP_ITERM_T;
/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/


/*----------------------------------------------*
 * 导出函数原型说明                             *
 *----------------------------------------------*/
extern int net_portmap_add(unsigned short outport, unsigned short inport, char *pcIpAddr, unsigned char prot);
extern int net_portmap_del(unsigned short outport, unsigned short inport, char *pcIpAddr, unsigned char prot);
extern int net_portmap_show (PORTMAP_ITERM_T *pstRouteIterm);

#endif

