/******************************************************************************

                  版权所有 (C), 2007-2012, 上海寰创通信科技有限公司

 ******************************************************************************
  文 件 名   : pal_route.h
  版 本 号   : 初稿
  作    者   : 董鹏
  生成日期   : 2014年4月18日
  最近修改   :
  功能描述   : route pal API
  函数列表   :
  修改历史   :
  1.日    期   : 2014年4月18日
    作    者   : 董鹏
    修改内容   : 创建文件

******************************************************************************/
#ifndef __PAL_ROUTE_H__
#define __PAL_ROUTE_H__


/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/
#define ROUTE_CMD_LINE      128
#define ROUTE               "/proc/net/route"
#define RTF_UP              0x0001	/* route usable */
#define IPADDRLEN           16
#define MACADDRLEN          32
#define DEVNAMELEN          64

typedef struct
{   
    char acDestIp[IPADDRLEN];      /* Destination ip */    
    char acGwMac[IPADDRLEN];       /* Gateway */  
	char acGenMask[IPADDRLEN];     /* Genmask */     
    char acDevName[DEVNAMELEN];     /* Interface name */ 
}ROUTE_INFO_E;            

typedef struct
{
    unsigned int uiIterm;                 /* Iterm count */
    ROUTE_INFO_E *pstRouteInfo;
    
}ROUTE_ITERM_T;
/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/


/*----------------------------------------------*
 * 导出函数原型说明                             *
 *----------------------------------------------*/
extern int net_route_add(char *pcIpAddr, char *GenMask, char *Gw, char *IfName);
extern int net_route_del(char *pcIpAddr, char *GenMask, char *Gw, char *IfName);
extern int net_route_show (ROUTE_ITERM_T *pstRouteIterm);

#endif

